### 🌊 Neptune Plan Results

**Terraform Stacks:** `apps/web, apps/web/ci-102-1, apps/web/ci-102-2`

**Neptune completed the plan with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23578883599)

**Command ✅** `terragrunt init -upgrade` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 05:23:56.887 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web] 05:23:57.145 STDOUT tofu: Initializing the backend...
05:23:57.413 STDOUT tofu: 
05:23:57.413 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:23:57.413 STDOUT tofu: use this backend unless the backend configuration changes.
05:23:57.542 STDOUT tofu: Initializing provider plugins...
05:23:57.542 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:23:57.590 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:23:57.734 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:23:58.015 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:23:58.138 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:23:58.342 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:23:58.342 STDOUT tofu: Providers are signed by their developers.
05:23:58.342 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:23:58.342 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:23:58.342 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:23:58.342 STDOUT tofu: selections it made above. Include this file in your version control repository
05:23:58.342 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:23:58.342 STDOUT tofu: you run "tofu init" in the future.
05:23:58.342 STDOUT tofu: OpenTofu has been successfully initialized!
05:23:58.342 STDOUT tofu: 
05:23:58.342 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:23:58.342 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:23:58.342 STDOUT tofu: should now work.
05:23:58.342 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:23:58.343 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:23:58.343 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-1] 05:23:58.659 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/LjDMVE2jnA-r4KEPw1_3gHdJxtE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-102-1] 05:23:58.875 STDOUT tofu: Initializing the backend...
05:23:59.069 STDOUT tofu: 
05:23:59.070 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:23:59.070 STDOUT tofu: use this backend unless the backend configuration changes.
05:23:59.247 STDOUT tofu: Initializing provider plugins...
05:23:59.247 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:23:59.293 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:23:59.448 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:23:59.654 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:23:59.762 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:23:59.986 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:23:59.986 STDOUT tofu: Providers are signed by their developers.
05:23:59.986 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:23:59.987 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:23:59.987 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:23:59.987 STDOUT tofu: selections it made above. Include this file in your version control repository
05:23:59.987 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:23:59.987 STDOUT tofu: you run "tofu init" in the future.
05:23:59.987 STDOUT tofu: OpenTofu has been successfully initialized!
05:23:59.987 STDOUT tofu: 
05:23:59.987 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:23:59.987 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:23:59.987 STDOUT tofu: should now work.
05:23:59.987 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:23:59.987 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:23:59.987 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-2] 05:24:00.305 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/Yc3gcfg0bxbyefOz0IsZf6F6epE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-102-2] 05:24:00.540 STDOUT tofu: Initializing the backend...
05:24:00.733 STDOUT tofu: 
05:24:00.733 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:24:00.734 STDOUT tofu: use this backend unless the backend configuration changes.
05:24:00.843 STDOUT tofu: Initializing provider plugins...
05:24:00.843 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:24:00.882 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:24:01.026 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:24:01.266 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:24:01.389 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:24:01.615 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:24:01.615 STDOUT tofu: Providers are signed by their developers.
05:24:01.615 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:24:01.615 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:24:01.615 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:24:01.615 STDOUT tofu: selections it made above. Include this file in your version control repository
05:24:01.615 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:24:01.615 STDOUT tofu: you run "tofu init" in the future.
05:24:01.615 STDOUT tofu: OpenTofu has been successfully initialized!
05:24:01.615 STDOUT tofu: 
05:24:01.615 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:24:01.615 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:24:01.615 STDOUT tofu: should now work.
05:24:01.615 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:24:01.615 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:24:01.615 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web] 05:24:02.814 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
05:24:02.815 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:24:02.826 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:24:02.826 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:24:02.826 STDOUT tofu:   + create
05:24:02.826 STDOUT tofu: OpenTofu will perform the following actions:
05:24:02.826 STDOUT tofu:   # local_file.output will be created
05:24:02.826 STDOUT tofu:   + resource "local_file" "output" {
05:24:02.826 STDOUT tofu:       + content              = "apps/web deployed"
05:24:02.826 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:24:02.826 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:24:02.827 STDOUT tofu:       + content_md5          = (known after apply)
05:24:02.827 STDOUT tofu:       + content_sha1         = (known after apply)
05:24:02.827 STDOUT tofu:       + content_sha256       = (known after apply)
05:24:02.827 STDOUT tofu:       + content_sha512       = (known after apply)
05:24:02.827 STDOUT tofu:       + directory_permission = "0777"
05:24:02.827 STDOUT tofu:       + file_permission      = "0777"
05:24:02.827 STDOUT tofu:       + filename             = "./output.txt"
05:24:02.827 STDOUT tofu:       + id                   = (known after apply)
05:24:02.827 STDOUT tofu:     }
05:24:02.827 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:24:02.827 STDOUT tofu: 
05:24:02.827 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:24:02.827 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:24:02.827 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-102-1] 05:24:04.091 STDOUT tofu: null_resource.stack: Refreshing state... [id=513367671554999496]
05:24:04.092 STDOUT tofu: local_file.output: Refreshing state... [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:24:04.102 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:24:04.102 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:24:04.102 STDOUT tofu:   + create
05:24:04.102 STDOUT tofu: OpenTofu will perform the following actions:
05:24:04.102 STDOUT tofu:   # local_file.output will be created
05:24:04.102 STDOUT tofu:   + resource "local_file" "output" {
05:24:04.102 STDOUT tofu:       + content              = "apps/web/ci-102-1 deployed"
05:24:04.102 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:24:04.102 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:24:04.102 STDOUT tofu:       + content_md5          = (known after apply)
05:24:04.103 STDOUT tofu:       + content_sha1         = (known after apply)
05:24:04.103 STDOUT tofu:       + content_sha256       = (known after apply)
05:24:04.103 STDOUT tofu:       + content_sha512       = (known after apply)
05:24:04.103 STDOUT tofu:       + directory_permission = "0777"
05:24:04.103 STDOUT tofu:       + file_permission      = "0777"
05:24:04.103 STDOUT tofu:       + filename             = "./output.txt"
05:24:04.103 STDOUT tofu:       + id                   = (known after apply)
05:24:04.103 STDOUT tofu:     }
05:24:04.103 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:24:04.103 STDOUT tofu: 
05:24:04.103 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:24:04.103 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:24:04.103 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-102-2] 05:24:05.231 STDOUT tofu: null_resource.stack: Refreshing state... [id=2217601692384182174]
05:24:05.232 STDOUT tofu: local_file.output: Refreshing state... [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:24:05.243 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:24:05.243 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:24:05.243 STDOUT tofu:   + create
05:24:05.243 STDOUT tofu: OpenTofu will perform the following actions:
05:24:05.243 STDOUT tofu:   # local_file.output will be created
05:24:05.243 STDOUT tofu:   + resource "local_file" "output" {
05:24:05.243 STDOUT tofu:       + content              = "apps/web/ci-102-2 deployed"
05:24:05.243 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:24:05.243 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:24:05.243 STDOUT tofu:       + content_md5          = (known after apply)
05:24:05.243 STDOUT tofu:       + content_sha1         = (known after apply)
05:24:05.243 STDOUT tofu:       + content_sha256       = (known after apply)
05:24:05.243 STDOUT tofu:       + content_sha512       = (known after apply)
05:24:05.243 STDOUT tofu:       + directory_permission = "0777"
05:24:05.243 STDOUT tofu:       + file_permission      = "0777"
05:24:05.243 STDOUT tofu:       + filename             = "./output.txt"
05:24:05.243 STDOUT tofu:       + id                   = (known after apply)
05:24:05.243 STDOUT tofu:     }
05:24:05.244 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:24:05.244 STDOUT tofu: 
05:24:05.244 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:24:05.244 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:24:05.244 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>


To apply these changes, comment:
```
@neptbot apply
```
